# todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.

dgt_one = 5
dgt_two = 2

print(dgt_one+dgt_two)
print(dgt_one-dgt_two)
print(dgt_one/dgt_two)
print(dgt_one*dgt_two)
print(dgt_one//dgt_two)
print(dgt_one % dgt_two)
print(dgt_one**dgt_two)

