# todo: Определить в коде  переменные:

# 1. Целочисленного типа
# 2. Вещественного типа
# 3. Логического типа
# 4. Строкового типа
# 5. Пустого типа
#
# Вывести все их типы.

# TODO: Решение:

integer = 100
divide_integer_is_float = integer/2
boolean = bool(integer)
one_string = str(integer)
make_none_type = None

print(type(integer))
print(type(divide_integer_is_float))
print(type(boolean))
print(type(one_string))
print(type(make_none_type))
